{
  "scenes": [
    {
      "text": "I cant get infections, I cant get sick, I regrow my organs in a matter of seconds, I can regenerate a liter of blood every ten seconds, my limbs arent an issue either. I have what can be best understood as a massive healing factor. Ive always had it, the healing factor. Ever since I was a kid, I've never scraped my knee, never caught a cold, never had to go to the nurse, and never broken a bone, despite participating in various sports. Everybody initially assumed I had a strong immune system or was simply lucky. I went most of my life believing I was just a lucky guy. When I went in for my vaccinations, the doctors said my skin was unusually thick and they had to inject me quickly and remove the needle even quicker. I never even got drunk; no matter how many shots I took, I never got even tipsy, nor did I ever vomit. I always attributed that to some sort of immunity; nothing I smoked in my teens got me anywhere either. I was in a car accident when I was 22.",
      "duration": 63.0
    },
    {
      "text": "It was bad, I rolled four times, and ended up crushed between the car that rear-ended me and a tree. The car was totaled, and I shouldve been, too. I thought I was dead when I saw my shattered leg begin to crack and force itself back together, when the blood that poured out of my head suddenly became a trickle, then nothing. What eyesight I had left in my eyes came back just as quickly. Doctors called it a miracle that I walked away from that accident; most that had to be done was cutting me out of the car. I knew what I saw, but the doctors told me I was probably just hallucinating from the accident. When I didnt have even a little whiplash in the morning, I went to the hospital. I thought I was in shock, and I wanted to make sure nothing was wrong. Not even a bruise. The doctors sent me home that night, and when I got home, I needed to be sure of something. I grabbed a kitchen knife and cut into my left index finger, just enough to cut through the very tip of the finger.",
      "duration": 65.33333333333333
    },
    {
      "text": "It hurt like hell, but as I suspected, the bleeding only lasted for a moment, and the tip was back. It looked exactly like the old one, and I knew I wasnt hallucinating since my disembodied fingertip was still on the counter. This should have been the discovery of a lifetime, and for a brief second it was. I ran to the hospital and chopped my finger off in the lobby. I let the disembodied digit hit the floor to the terror of everybody in the office, but within seconds, the finger was back. I grabbed my old finger and showed it to the nurses who surrounded me. Whispers of magic tricks went around until I chopped my hand off. Blood spewed for only a second, like the last bits of water stuck in a shower head, then stopped. My palm came back, then my fingers. Within moments, I was on the news. The Miraculous Healing Man was one headline I still remember. I was a celebrity, I was a philanthropist, and I had it all. I lived off of donations and whatever blood drives were willing to give me.",
      "duration": 63.333333333333336
    },
    {
      "text": "I ended the blood crisis; I have O- blood, so I can give to anybody. A lot of my days were spent playing video games while a nurse tracked how many bloodbags I produced in 8 hours. Occasionally, the nurse would have to phone a friend to get more bags. If I drank a lot of water that day, well, theyd fill up quite fast. My body healed around the needles, so prying them out was a bit of a chore. Eventually, I discussed it with the nurses to just keep the needle in there. It honestly wasnt worth the hassle, and since I declared this my full-time job it wasnt like I was worried about what work would think. Sleeping with it in was a bit weird, but you get used to it. When I got a call from one of the many nurses who serviced me, asking if I was willing to personally donate my kidney to her son, I didnt know what to do. At that point, I wasnt sure if I could or couldnt regrow organs. I had a bit of a crush on her, though, so I went through with it.",
      "duration": 65.33333333333333
    },
    {
      "text": "According to the doctors, the biggest complication regarding the surgery was figuring out how to actually keep my body from closing up the incision. They just had to have somebody constantly scraping the area with a scalpel to keep it open, alongside keeping me pumped full of anesthetics, as my body fights them off quickly. All in all, it was a success, and by the end of the day, I was back home giving blood again. I went back the next day, and yep, I had two fully functioning kidneys. There wasnt even a scar left from the incision. That's when a doctor entered the room and sat down with me. An 8 year old boy needs a kidney, are you willing to go through the surgery again? I didnt think, I just agreed. Later that day, the boy had a functioning kidney in him, and I wasnt left with any less than what I started with. They kept me in the hospital overnight. I wasnt sure why they never made me before, but I didnt really care. With all my donations ,blood and organ-wise, paying for the surgeries or hospital stay wasnt an issue.",
      "duration": 65.0
    },
    {
      "text": "At this point, people still donated money to me directly, and I didnt mind losing a day of blood donations. When I woke up that morning, a little girl was sitting down next to my bed, and a scrub-laden doctor sat up out of his chair. This is Samantha, shes gonna need a heart transplant by next month or shell die. Are you willing? I was. I wasnt sure if the removal of my heart would kill me. I regrew a kidney twice in 3 days, and I was confident. That little girl had a heart at the end of the day, and so did I. They didnt permit me to leave then either, but I understood that one. I was starting to get homesick at that point, and tried to check out in the middle of the night, but was stopped by various nurses begging me to stay. Telling me about all the organs the hospital needs, how understaffed they are, how quickly they could solve major world problems if I just stayed a little longer. I gave three people a chance to live normal to semi-normal lives so far.",
      "duration": 63.666666666666664
    }
  ],
  "source_block": 1
}