{
  "title": "My sister and I stopped to pee in the woods after a gala… and something touched her",
  "shots": [
    {
      "idx": 0,
      "text": "I honestly don’t even know how to explain this, but it’s been stuck in my head and I need to let it out. So last weekend, my sister (25F) and I (28M) were coming back from this fancy gala thing. She was in this long shiny gold pattern dress like, proper full length gown and I was wearing a plain black suit. It was around 10:30 in the midnight, pitch dark, and we were driving on this completely deserted road. No streetlights. No cars. Just endless trees on both sides. Like, proper middle of nowhere vibes. After about 20 mins of driving, she suddenly said, “I need to pee. Like now.” I thought she was joking, but she was serious. So I pulled over onto the shoulder, but the side of the road was full of dry thorny plants and rough stuff nothing you’d want to squat over, especially not in a dress like hers.",
      "background": "C:\\Users\\tyler\\RedditVideoBot\\assets\\backgrounds\\6 hour Minecraft parkour run (no falls, study, sleep).webm",
      "est_duration": 59
    },
    {
      "idx": 1,
      "text": "She looked around and said, “Let’s just go into the trees. I can’t do it here.” She was nervous about going alone, so I told her I’d come with her. We walked like 100 meters into the woods using my phone flashlight, just far enough so no one from the road could see us though honestly, there was no one to see anyway. She finally found a tiny clearing and told me to turn around. Her dress was a pain in the ass she had to gather all the fabric up and hold it high around her waist just so she could squat without messing it up. She looked super awkward trying not to trip over it. Anyway, I turned around, stood a few steps away, and also decided to pee while we were there. Out of respect and weirdness, we agreed to turn off the flashlight. Total blackout. Only sound was just… yeah, you know. Peeing. On dry leaves.",
      "background": "C:\\Users\\tyler\\RedditVideoBot\\assets\\backgrounds\\Subway Surfers (2025) - Year of the Snake - Gameplay (PC UHD) [4K60FPS].webm",
      "est_duration": 61
    },
    {
      "idx": 2,
      "text": "And then no joke she SCREAMED. Like, blood curdling scream. I panicked, still mid piss, and spun around trying to turn the flashlight back on. She was still squatting, dress in hands, completely freaked out, looking behind her. I asked, “What happened??” and she just stared at me and said, “Someone touched me. On both shoulders. Like, actual hands.” I swear on everything there was no one around us. I immediately did a 360 with the light, shining it between trees and bushes, even looking up like a maniac. But there was nothing. No animal sounds. No rustling. Just silent woods. She was almost crying, trying to adjust her dress again, and it was taking forever. In that moment, while she was still fixing herself, I heard footsteps. I’m not exaggerating it was like someone slowly stepping on leaves, circling us. Not fast. Just... deliberate. I didn’t say anything at first because I didn’t want to freak her out more.",
      "background": "C:\\Users\\tyler\\RedditVideoBot\\assets\\backgrounds\\3 Hour Parkour with Shaders in Minecraft (No Falls, Relaxing, Sleep).webm",
      "est_duration": 61
    },
    {
      "idx": 3,
      "text": "But she looked at me and said, “Do you hear that?” We both just stood still for a few seconds. Then bolted. We ran in the direction we thought the car was, but we couldn’t find it. It was like we came out from a different part of the woods or something. Panic started setting in because it felt like we were going in circles. Then we noticed this weird dark hollow in the trees about 100 meters aheadlike a cave opening or somethingbut we didn’t dare go near it. Eventually, after for like 7 minutes, we finally hit the road again. But not where we entered. We had come out a good half kilometer away from the car. When we saw it, we sprinted toward it,and locked the doors, and didn’t speak the entire ride back to the hotel. I’ve never seen my sister that shaken. She’s not the type to make up weird ghosty stuff.",
      "background": "C:\\Users\\tyler\\RedditVideoBot\\assets\\backgrounds\\6 hour Minecraft parkour run (no falls, study, sleep).webm",
      "est_duration": 60
    },
    {
      "idx": 4,
      "text": "And honestly… I felt it too. Something wasn’t right out there. We still don’t know what the hell happened. But one thing's for sure we’re NEVER stopping in the woods again. Ever",
      "background": "C:\\Users\\tyler\\RedditVideoBot\\assets\\backgrounds\\3 hours of relaxing Minecraft parkour (15k Jumps, Reminiscent, Shaders).webm",
      "est_duration": 12
    }
  ]
}