[
  {
    "title": "My sister and I stopped to pee in the woods after a gala… and something touched her",
    "body": "I honestly don’t even know how to explain this, but it’s been stuck in my head and I need to let it out.\n\nSo last weekend, my sister (25F) and I (28M) were coming back from this fancy gala thing. She was in this long shiny gold pattern dress like, proper full length gown and I was wearing a plain black suit. It was around 10:30 in the midnight, pitch dark, and we were driving on this completely deserted road. No streetlights. No cars. Just endless trees on both sides. Like, proper middle of nowhere vibes.\n\nAfter about 20 mins of driving, she suddenly said, “I need to pee. Like now.” I thought she was joking, but she was serious. So I pulled over onto the shoulder, but the side of the road was full of dry thorny plants and rough stuff nothing you’d want to squat over, especially not in a dress like hers.\n\nShe looked around and said, “Let’s just go into the trees. I can’t do it here.” She was nervous about going alone, so I told her I’d come with her. We walked like 100 meters into the woods using my phone flashlight, just far enough so no one from the road could see us though honestly, there was no one to see anyway.\n\nShe finally found a tiny clearing and told me to turn around. Her dress was a pain in the ass she had to gather all the fabric up and hold it high around her waist just so she could squat without messing it up. She looked super awkward trying not to trip over it.\n\nAnyway, I turned around, stood a few steps away, and also decided to pee while we were there. Out of respect and weirdness, we agreed to turn off the flashlight. Total blackout. Only sound was just… yeah, you know. Peeing. On dry leaves.\n\nAnd then no joke she SCREAMED.\n\nLike, blood curdling scream.\n\nI panicked, still mid piss, and spun around trying to turn the flashlight back on. She was still squatting, dress in hands, completely freaked out, looking behind her.\n\nI asked, “What happened??” and she just stared at me and said, “Someone touched me. On both shoulders. Like, actual hands.”\n\nI swear on everything there was no one around us. I immediately did a 360 with the light, shining it between trees and bushes, even looking up like a maniac. But there was nothing. No animal sounds. No rustling. Just silent woods.\n\nShe was almost crying, trying to adjust her dress again, and it was taking forever. In that moment, while she was still fixing herself, I heard footsteps. I’m not exaggerating it was like someone slowly stepping on leaves, circling us. Not fast. Just... deliberate.\n\nI didn’t say anything at first because I didn’t want to freak her out more. But she looked at me and said, “Do you hear that?”\n\nWe both just stood still for a few seconds. Then bolted.\n\nWe ran in the direction we thought the car was, but we couldn’t find it. It was like we came out from a different part of the woods or something. Panic started setting in because it felt like we were going in circles. Then we noticed this weird dark hollow in the trees about 100 meters aheadlike a cave opening or somethingbut we didn’t dare go near it.\n\nEventually, after for like 7 minutes, we finally hit the road again. But not where we entered. We had come out a good half kilometer away from the car.\n\nWhen we saw it, we sprinted toward it,and  locked the doors, and didn’t speak the entire ride back to the hotel.\n\nI’ve never seen my sister that shaken. She’s not the type to make up weird ghosty stuff. And honestly… I felt it too. Something wasn’t right out there. We still don’t know what the hell happened.\n\nBut one thing's for sure we’re NEVER stopping in the woods again. Ever\n\n\n",
    "score": 13,
    "id": "1nqw2ah",
    "permalink": "https://reddit.com/r/ParanormalEncounters/comments/1nqw2ah/my_sister_and_i_stopped_to_pee_in_the_woods_after/"
  },
  {
    "title": "Elderly lady let's me sleep",
    "body": "More than twenty years ago I (49F) left an abusive husband.  I had moved from Canada to the US for him.  When I made the decision to leave him, I saved as much money as I could which turned out to be around $5000.00USD.  On the day I left he said good luck with that and took my purse.   \"Good luck getting on a plane without ID\" Were his last words to me.  \n\nAs this was just after 9/11 I knew it would be difficult to get my 2 children (6m and 9months f) (they are both Canadian) across the border, so I was already stressed out.  But I got on a bus (screw him. You didn't need ID on a bus asshat). \n\nI paid for tickets and we left.  I had cargo pants on and all of that 5000 was in the various pockets.  (He didn't know I took the money).  About 3 days into the journey I was exhausted. Caring for a baby and a 6 year old on the bus was brutal.  \n\nAn elderly lady across the aisle from us asked if she could hold my daughter.  Seeing as it was relatively safe I handed her over.  The lady looked at me and said why don't you try yo sleep for a while.  I've taken care of 4 children and 8 grandchildren if that helps.  My son moved over to sit next to her and I handed her the diaper bag and fell asleep.  I woke up 4 hours later.  My daughter was asleep in this woman's arms and my son was playing with his cars happy as a clam.   The bus was pulling into Chicago and I decided to use some of my money to buy this woman lunch or just give her some money.  But when I got off the bus I couldn't find her.  I searched everywhere.  Nothing.  To this day I think she was an angel.  I wish I could have found her.  She has no idea what she did for us.  \n\nThank you for reading this.  ",
    "score": 250,
    "id": "1npljxq",
    "permalink": "https://reddit.com/r/ParanormalEncounters/comments/1npljxq/elderly_lady_lets_me_sleep/"
  },
  {
    "title": "Was it me or something else",
    "body": "Growing up I was abused by a family member; they would sneak into my room at night. During the “investigation” my parents told me to knock on the wall, if they came into the room or felt threatened. I did this a couple of times. I was really scared growing up and much of that fear was in this room. Much of it I have repressed.\n\nFlash forward to 15 years give or take, another family member now lives in the home with their spouse. Their spouses family member stays in my former room. One day the family member hears a knock on the wall so they knock back. They get no response so they decide to go check who was knocking. No one else was home.\n\nThey said they heard the knocking on the wall between the room and living room. Same wall I would knock on.\n\nI have listened to several podcasts and learned about residual hauntings but also our souls haunting places associated with trauma.\n\nSo my question is was it residual, was it me, or something else?",
    "score": 12,
    "id": "1nq0fld",
    "permalink": "https://reddit.com/r/ParanormalEncounters/comments/1nq0fld/was_it_me_or_something_else/"
  },
  {
    "title": "My brother filmed this about 20 years ago",
    "body": "Apologies for the quality...but this was peak mobile phone camera about 20 years ago....my brother lived in a flat(apartment) which was built upon where the old gallows used to be, and would experience the odd strange thing, he's not the only person that lived their that claimed weird things either.....anyway, this was one of the few he caught on video.   Might not seem that crazy now, but at the time it certainly was strange to say the least.",
    "score": 283,
    "id": "1np995d",
    "permalink": "https://reddit.com/r/ParanormalEncounters/comments/1np995d/my_brother_filmed_this_about_20_years_ago/"
  },
  {
    "title": "I really need help. Did this happen to me? Is this paranormal? Is this something else?",
    "body": "I am a little freaked out. Sorry in advance for the length.\n\n(I’ve shared a previous experience like this in the Glitch matrix community, but they removed it saying it was better suited here.)\n\nI’m a pretty grounded person. Call me a “science girly.” I lean skeptical. But I’ve had weird experiences in the past. I do dabble in a little archetype/tarot/Jungian stuff now and then. Not really in a “predict the future” way, more like a tool for thinking about big ideas. Although often synchronicities pop up.\n\nSo here’s what happened.\n\nYesterday morning, while I was out running errands I was thinking about a lot of the weird experiences I’ve had. Genuinely off the wall synchronicities and visualizations that I have spent years trying to rationalize with science or as mere coincidence. And I can’t. It’s making me in sane. \n\nAt a stop light, I just blurted out, “Am I crazy, or do these coincidences in my life mean something? If this is real, just… show me a sign.” I can’t say if I was really asking or just… I don’t know, talking to myself? I felt nuts, so I just put it completely out of my head and went about my day.\n\nThen when I got home, I pulled a card from Kim Kranz’s Archetypes deck. I love this deck, it really challenges me as a writer and as, well, a human being to thing about larger concepts that are outside of myself, or push me into essential shadow work.\n\nThe card I pulled was called “The One,” which I’ve included in all of the photos I’ve shared. The image? A glowing orb in darkness. \n\nThe guidebook for this specific card referenced James Turrell, a light artist who literally makes color-shifting light installations, specifically one called “The Color Inside” (an excerpt I’ve also included in the photos I shared.)\n\nI thought it was neat, the whole concept is about oneness and being connected (you can see the description of the card also in the photos I shared). \n\nThen I went back to work. \n\nFast forward to last night: I’m lying in bed, lights off, just my TV on, while also doomscrolling.\n\nI have this rechargeable orb light I’ve owned for about 3 months. It doesn’t stay plugged in. You charge it every so often, and it runs until the battery dies. You turn it on by flipping it over and VERY FIRMLY pressing a button on the bottom. There’s also a remote, but it’s been in a drawer for the past few weeks because I rarely use this light.\n\nWhat’s important to know about this light is that it takes more than 15 presses to get to my favorite seamless color cycling mode - it’s the last option. If you turn it off on this mode, it won’t restart on the mode you last had it. You either have to use the remote to select that particular mode, or you have to click ALLLLL the way through to get back to that mode. This is important.\n\nOut of nowhere, around 8:30 p.m., the left side of my room lights up. \n\nI turn and see my orb lamp on the floor, glowing, on the seamless color-cycling mode. It turned itself on.\n\nAt first I was just weirded out by it. It’s never done that before. \n\nI tried not to think about it, but it was just there, glowing and changing color. Finally, I picked it up off the floor about 45(ish) minutes later and walked to my desk.\n\nThat’s when, I looked up at the card art I had tossed on my desk to the side hours earlier, and my orb lamp looked exactly the same. \n\nThen later, while explaining it to my boyfriend on the phone, I remembered the James Turrell reference in the guidebook.\n\nSo now I’m sitting here asking myself: is this just one giant coincidence? \n\nMaybe it glitched on, sure. Theoretically, that’s the most rational explanation. \n\nBut in 3 months it has never done that. And for it to happen the exact day I pull a “glowing orb” card, the meaning behind the card itself, the card, then referencing referencing a color-light artist, after I literally asked for a sign? And for it to happen in the exact mode that mirrors the art, at night, in total darkness? Visually it’s just identical and very confusing.\n\nIf that’s a coincidence, it’s a fucking bananas one.\n\nI just had to share this here. \n\nThese experiences (this is just the most recent one) have been both awe-inspiring but also very confusing for me. It makes me nervous sometimes to ask questions out loud or try to visualize something. I don’t really understand what’s happening. \n\nAnd if this is the wrong place, I’m sorry, please let me know where I should go. Glitch says this isn’t for them, and I just feel a bit lost.\n",
    "score": 15,
    "id": "1npua21",
    "permalink": "https://reddit.com/r/ParanormalEncounters/comments/1npua21/i_really_need_help_did_this_happen_to_me_is_this/"
  }
]